<template>
  <v-sheet class="my-6 mx-auto" max-width="1000">
    <h1>ក្រុមស្រាវជ្រាវអេកូលែន</h1>
    <p class="mt-3">
      {{ "និយាយអ្វីមួយអំពិអេកូលែននៅទីនេះ។ ".repeat(16) }}
    </p>
    <h1 class="mb-6">អ្នកស្រាវជ្រាវ</h1>
    <v-row class="d-flex justify-space-around">
      <nyak-srouchriou
        v-for="អ្នក in អ្នកស្រាវជ្រាវ.filter(អ្នក => អ្នក.តួនាទី === 'អ្នកស្រាវជ្រាវ')"
        :key="អ្នក.ឈ្មោះ"
        :chmoah="អ្នក.ឈ្មោះ"
        :ruptot="អ្នក.រូបថត"
        :ambi="អ្នក.អំពិ"
      />
    </v-row>
    <h1 class="my-6">អ្នកស្រាវជ្រាវសហការ</h1>
    <v-row class="d-flex justify-space-around">
      <nyak-srouchriou
        v-for="អ្នក in អ្នកស្រាវជ្រាវ.filter(អ្នក => អ្នក.តួនាទី === 'អ្នកស្រាវជ្រាវសហការ')"
        :key="អ្នក.ឈ្មោះ"
        :chmoah="អ្នក.ឈ្មោះ"
        :ruptot="អ្នក.រូបថត"
        :ambi="អ្នក.អំពិ"
      />
    </v-row>
    <h1 class="my-6">អ្នកហាត់ការ</h1>
    <v-row class="d-flex justify-space-around">
      <nyak-srouchriou
        v-for="អ្នក in អ្នកស្រាវជ្រាវ.filter(អ្នក => អ្នក.តួនាទី === 'អ្នកហាត់ការ')"
        :key="អ្នក.ឈ្មោះ"
        :chmoah="អ្នក.ឈ្មោះ"
        :ruptot="អ្នក.រូបថត"
        :ambi="អ្នក.អំពិ"
      />
    </v-row>
  </v-sheet>
</template>

<script>
import nyakSrouchriou from '../components/អ្នកស្រាវជ្រាវ.vue';

export default {
  name: 'AmbiYerng',
  components: { nyakSrouchriou },
  data: () => ({
    អ្នកស្រាវជ្រាវ: [
      {
        ឈ្មោះ: 'ដានិ',
        អំពិ: 'និយាយអ្អ្វីដែលគួរឱ្យចាប់អារម្មណ៍ អំពិខ្ញុំ។ និយាយអ្អ្វីដែលគួរឱ្យចាប់អារម្មណ៍ អំពិខ្ញុំ។ និយាយអ្អ្វីដែលគួរឱ្យចាប់អារម្មណ៍ អំពិខ្ញុំ។ និយាយអ្អ្វីដែលគួរឱ្យចាប់អារម្មណ៍ អំពិខ្ញុំ។ និយាយអ្អ្វីដែលគួរឱ្យចាប់អារម្មណ៍ អំពិខ្ញុំ។ និយាយអ្អ្វីដែលគួរឱ្យចាប់អារម្មណ៍ អំពិខ្ញុំ។',
        // eslint-disable-next-line
        រូបថត: require('../assets/IMG_2010 - 1.jpg'),
        តួនាទី: 'អ្នកស្រាវជ្រាវ',
      },
      {
        ឈ្មោះ: 'ភិទូរ',
        អំពិ: 'និយាយអ្អ្វីដែលគួរឱ្យចាប់អារម្មណ៍ អំពិខ្ញុំ។ និយាយអ្អ្វីដែលគួរឱ្យចាប់អារម្មណ៍ អំពិខ្ញុំ។ និយាយអ្អ្វីដែលគួរឱ្យចាប់អារម្មណ៍ អំពិខ្ញុំ។ និយាយអ្អ្វីដែលគួរឱ្យចាប់អារម្មណ៍ អំពិខ្ញុំ។ និយាយអ្អ្វីដែលគួរឱ្យចាប់អារម្មណ៍ អំពិខ្ញុំ។ និយាយអ្អ្វីដែលគួរឱ្យចាប់អារម្មណ៍ អំពិខ្ញុំ។',
        // eslint-disable-next-line
        រូបថត: require('../assets/IMG_1952 copie.jpg'),
        តួនាទី: 'អ្នកស្រាវជ្រាវ',
      },
      {
        ឈ្មោះ: 'ធារ៉ា',
        អំពិ: 'និយាយអ្អ្វីដែលគួរឱ្យចាប់អារម្មណ៍ អំពិខ្ញុំ។ និយាយអ្អ្វីដែលគួរឱ្យចាប់អារម្មណ៍ អំពិខ្ញុំ។ និយាយអ្អ្វីដែលគួរឱ្យចាប់អារម្មណ៍ អំពិខ្ញុំ។ និយាយអ្អ្វីដែលគួរឱ្យចាប់អារម្មណ៍ អំពិខ្ញុំ។ និយាយអ្អ្វីដែលគួរឱ្យចាប់អារម្មណ៍ អំពិខ្ញុំ។ និយាយអ្អ្វីដែលគួរឱ្យចាប់អារម្មណ៍ អំពិខ្ញុំ។',
        // eslint-disable-next-line
        រូបថត: require('../assets/IMG_1938 copie.jpg'),
        តួនាទី: 'អ្នកស្រាវជ្រាវ',
      },
      {
        ឈ្មោះ: 'ស្រីទូច',
        អំពិ: 'និយាយអ្អ្វីដែលគួរឱ្យចាប់អារម្មណ៍ អំពិខ្ញុំ។ និយាយអ្អ្វីដែលគួរឱ្យចាប់អារម្មណ៍ អំពិខ្ញុំ។ និយាយអ្អ្វីដែលគួរឱ្យចាប់អារម្មណ៍ អំពិខ្ញុំ។ និយាយអ្អ្វីដែលគួរឱ្យចាប់អារម្មណ៍ អំពិខ្ញុំ។ និយាយអ្អ្វីដែលគួរឱ្យចាប់អារម្មណ៍ អំពិខ្ញុំ។ និយាយអ្អ្វីដែលគួរឱ្យចាប់អារម្មណ៍ អំពិខ្ញុំ។',
        // eslint-disable-next-line
        រូបថត: require('../assets/IMG_1940 copie.jpg'),
        តួនាទី: 'អ្នកស្រាវជ្រាវ',
      },
      {
        ឈ្មោះ: 'អ្នកផ្សែង',
        អំពិ: 'និយាយអ្អ្វីដែលគួរឱ្យចាប់អារម្មណ៍ អំពិខ្ញុំ។ និយាយអ្អ្វីដែលគួរឱ្យចាប់អារម្មណ៍ អំពិខ្ញុំ។ និយាយអ្អ្វីដែលគួរឱ្យចាប់អារម្មណ៍ អំពិខ្ញុំ។ និយាយអ្អ្វីដែលគួរឱ្យចាប់អារម្មណ៍ អំពិខ្ញុំ។ និយាយអ្អ្វីដែលគួរឱ្យចាប់អារម្មណ៍ អំពិខ្ញុំ។ និយាយអ្អ្វីដែលគួរឱ្យចាប់អារម្មណ៍ អំពិខ្ញុំ។',
        រូបថត: '',
        តួនាទី: 'អ្នកស្រាវជ្រាវសហការ',
      },
      {
        ឈ្មោះ: 'អ្នកផ្សែង',
        អំពិ: 'និយាយអ្អ្វីដែលគួរឱ្យចាប់អារម្មណ៍ អំពិខ្ញុំ។ និយាយអ្អ្វីដែលគួរឱ្យចាប់អារម្មណ៍ អំពិខ្ញុំ។ និយាយអ្អ្វីដែលគួរឱ្យចាប់អារម្មណ៍ អំពិខ្ញុំ។ និយាយអ្អ្វីដែលគួរឱ្យចាប់អារម្មណ៍ អំពិខ្ញុំ។ និយាយអ្អ្វីដែលគួរឱ្យចាប់អារម្មណ៍ អំពិខ្ញុំ។ និយាយអ្អ្វីដែលគួរឱ្យចាប់អារម្មណ៍ អំពិខ្ញុំ។',
        រូបថត: '',
        តួនាទី: 'អ្នកហាត់ការ',
      },
    ],
  }),
};
</script>
