<template>
  <v-sheet class="my-6 mx-auto" max-width="1000">
    <h1 class="mb-6">កម្រោងស្រាវរបស់យើង</h1>
    <p class="mt-3">
      {{ "និយាយអ្វីមួយអំពិអេកូលែននៅទីនេះ។ ".repeat(16) }}
    </p>

    <h1 class="my-6">កម្រោងស្រាវជ្រាវបច្ចុប្បន្ន</h1>
    <v-row>
      <v-row class="d-flex justify-space-around">
        <komrong-srouchriou
          v-for="ក in កម្រោងស្រាវជ្រាវបច្ចុប្បន្ន"
          :key="ក.ឈ្មោះ"
          :chmoah="ក.ឈ្មោះ"
          :ruptot="ក.រូបថត"
          :ambi_kleih="ក.អំពិ_ខ្លី"
          :ambi="ក.អំពិ"
          :chnaam_chap="ក.ឆ្នាំចប់"
          :chnaam_chabphtaem="ក.ឆ្នាំចាប់ផ្តើម"
        />
      </v-row>
    </v-row>

    <h1 class="my-6">កម្រោងស្រាវជ្រាវដែលបានបញ្ចប់</h1>
    <v-row>
      <v-row class="d-flex justify-space-around">
        <komrong-srouchriou
          v-for="ក in កម្រោងស្រាវជ្រាវដែលបានបញ្ចប់"
          :key="ក.ឈ្មោះ"
          :chmoah="ក.ឈ្មោះ"
          :ruptot="ក.រូបថត"
          :ambi_kleih="ក.អំពិ_ខ្លី"
          :ambi="ក.អំពិ"
          :chnaam_chap="ក.ឆ្នាំចប់"
          :chnaam_chabphtaem="ក.ឆ្នាំចាប់ផ្តើម"
        />
      </v-row>
    </v-row>
  </v-sheet>
</template>
<script>
import komrongSrouchriou from '../components/កម្រោងស្រាវជ្រាវ.vue';

export default {
  name: 'AmbiYerng',
  components: { komrongSrouchriou },
  data: () => ({
    កម្រោង: [
      {
        ឈ្មោះ: 'ឈ្មោះកម្រោងនេះ',
        ឆ្នាំចាប់ផ្តើម: 2015,
        ឆ្នាំចប់: 2020,
        អំពិ_ខ្លី: 'អំពីកម្រោងស្រាវជ្រាវនេះ។ អំពីកម្រោងស្រាវជ្រាវនេះ។ អំពីកម្រោងស្រាវជ្រាវនេះ។',
        អំពិ: 'អំពីកម្រោងស្រាវជ្រាវនេះ។ អំពីកម្រោងស្រាវជ្រាវនេះ។ អំពីកម្រោងស្រាវជ្រាវនេះ។ អំពីកម្រោងស្រាវជ្រាវនេះ។ អំពីកម្រោងស្រាវជ្រាវនេះ។ អំពីកម្រោងស្រាវជ្រាវនេះ។ អំពីកម្រោងស្រាវជ្រាវនេះ។ អំពីកម្រោងស្រាវជ្រាវនេះ។ អំពីកម្រោងស្រាវជ្រាវនេះ។ អំពីកម្រោងស្រាវជ្រាវនេះ។ អំពីកម្រោងស្រាវជ្រាវនេះ។ អំពីកម្រោងស្រាវជ្រាវនេះ។ អំពីកម្រោងស្រាវជ្រាវនេះ។ អំពីកម្រោងស្រាវជ្រាវនេះ។ អំពីកម្រោងស្រាវជ្រាវនេះ។ អំពីកម្រោងស្រាវជ្រាវនេះ។ អំពីកម្រោងស្រាវជ្រាវនេះ។ អំពីកម្រោងស្រាវជ្រាវនេះ។ អំពីកម្រោងស្រាវជ្រាវនេះ។ អំពីកម្រោងស្រាវជ្រាវនេះ។ អំពីកម្រោងស្រាវជ្រាវនេះ។ អំពីកម្រោងស្រាវជ្រាវនេះ។ អំពីកម្រោងស្រាវជ្រាវនេះ។ អំពីកម្រោងស្រាវជ្រាវនេះ។',
      },
      {
        ឈ្មោះ: 'ឈ្មោះកម្រោងនោះ',
        ឆ្នាំចាប់ផ្តើម: 2020,
        ឆ្នាំចប់: 2025,
        អំពិ_ខ្លី: 'អំពីកម្រោងស្រាវជ្រាវនេះ។ អំពីកម្រោងស្រាវជ្រាវនេះ។ អំពីកម្រោងស្រាវជ្រាវនេះ។',
        អំពិ: 'អំពីកម្រោងស្រាវជ្រាវនេះ។ អំពីកម្រោងស្រាវជ្រាវនេះ។ អំពីកម្រោងស្រាវជ្រាវនេះ។ អំពីកម្រោងស្រាវជ្រាវនេះ។ អំពីកម្រោងស្រាវជ្រាវនេះ។ អំពីកម្រោងស្រាវជ្រាវនេះ។ អំពីកម្រោងស្រាវជ្រាវនេះ។ អំពីកម្រោងស្រាវជ្រាវនេះ។ អំពីកម្រោងស្រាវជ្រាវនេះ។ អំពីកម្រោងស្រាវជ្រាវនេះ។ អំពីកម្រោងស្រាវជ្រាវនេះ។ អំពីកម្រោងស្រាវជ្រាវនេះ។ អំពីកម្រោងស្រាវជ្រាវនេះ។ អំពីកម្រោងស្រាវជ្រាវនេះ។ អំពីកម្រោងស្រាវជ្រាវនេះ។ អំពីកម្រោងស្រាវជ្រាវនេះ។ អំពីកម្រោងស្រាវជ្រាវនេះ។ អំពីកម្រោងស្រាវជ្រាវនេះ។ អំពីកម្រោងស្រាវជ្រាវនេះ។ អំពីកម្រោងស្រាវជ្រាវនេះ។ អំពីកម្រោងស្រាវជ្រាវនេះ។ អំពីកម្រោងស្រាវជ្រាវនេះ។ អំពីកម្រោងស្រាវជ្រាវនេះ។ អំពីកម្រោងស្រាវជ្រាវនេះ។',
      },
      {
        ឈ្មោះ: 'ឈ្មោះកម្រោងនេះ',
        ឆ្នាំចាប់ផ្តើម: 2015,
        ឆ្នាំចប់: 2020,
        អំពិ_ខ្លី: 'អំពីកម្រោងស្រាវជ្រាវនេះ។ អំពីកម្រោងស្រាវជ្រាវនេះ។ អំពីកម្រោងស្រាវជ្រាវនេះ។',
        អំពិ: 'អំពីកម្រោងស្រាវជ្រាវនេះ។ អំពីកម្រោងស្រាវជ្រាវនេះ។ អំពីកម្រោងស្រាវជ្រាវនេះ។ អំពីកម្រោងស្រាវជ្រាវនេះ។ អំពីកម្រោងស្រាវជ្រាវនេះ។ អំពីកម្រោងស្រាវជ្រាវនេះ។ អំពីកម្រោងស្រាវជ្រាវនេះ។ អំពីកម្រោងស្រាវជ្រាវនេះ។ អំពីកម្រោងស្រាវជ្រាវនេះ។ អំពីកម្រោងស្រាវជ្រាវនេះ។ អំពីកម្រោងស្រាវជ្រាវនេះ។ អំពីកម្រោងស្រាវជ្រាវនេះ។ អំពីកម្រោងស្រាវជ្រាវនេះ។ អំពីកម្រោងស្រាវជ្រាវនេះ។ អំពីកម្រោងស្រាវជ្រាវនេះ។ អំពីកម្រោងស្រាវជ្រាវនេះ។ អំពីកម្រោងស្រាវជ្រាវនេះ។ អំពីកម្រោងស្រាវជ្រាវនេះ។ អំពីកម្រោងស្រាវជ្រាវនេះ។ អំពីកម្រោងស្រាវជ្រាវនេះ។ អំពីកម្រោងស្រាវជ្រាវនេះ។ អំពីកម្រោងស្រាវជ្រាវនេះ។ អំពីកម្រោងស្រាវជ្រាវនេះ។ អំពីកម្រោងស្រាវជ្រាវនេះ។',
      },
      {
        ឈ្មោះ: 'ឈ្មោះកម្រោងនោះ',
        ឆ្នាំចាប់ផ្តើម: 2020,
        ឆ្នាំចប់: 2025,
        អំពិ_ខ្លី: 'អំពីកម្រោងស្រាវជ្រាវនេះ។ អំពីកម្រោងស្រាវជ្រាវនេះ។ អំពីកម្រោងស្រាវជ្រាវនេះ។',
        អំពិ: 'អំពីកម្រោងស្រាវជ្រាវនេះ។ អំពីកម្រោងស្រាវជ្រាវនេះ។ អំពីកម្រោងស្រាវជ្រាវនេះ។ អំពីកម្រោងស្រាវជ្រាវនេះ។ អំពីកម្រោងស្រាវជ្រាវនេះ។ អំពីកម្រោងស្រាវជ្រាវនេះ។ អំពីកម្រោងស្រាវជ្រាវនេះ។ អំពីកម្រោងស្រាវជ្រាវនេះ។ អំពីកម្រោងស្រាវជ្រាវនេះ។ អំពីកម្រោងស្រាវជ្រាវនេះ។ អំពីកម្រោងស្រាវជ្រាវនេះ។ អំពីកម្រោងស្រាវជ្រាវនេះ។ អំពីកម្រោងស្រាវជ្រាវនេះ។ អំពីកម្រោងស្រាវជ្រាវនេះ។ អំពីកម្រោងស្រាវជ្រាវនេះ។ អំពីកម្រោងស្រាវជ្រាវនេះ។ អំពីកម្រោងស្រាវជ្រាវនេះ។ អំពីកម្រោងស្រាវជ្រាវនេះ។ អំពីកម្រោងស្រាវជ្រាវនេះ។ អំពីកម្រោងស្រាវជ្រាវនេះ។ អំពីកម្រោងស្រាវជ្រាវនេះ។ អំពីកម្រោងស្រាវជ្រាវនេះ។ អំពីកម្រោងស្រាវជ្រាវនេះ។ អំពីកម្រោងស្រាវជ្រាវនេះ។',
      },
    ],
  }),
  computed: {
    កម្រោងស្រាវជ្រាវដែលបានបញ្ចប់() {
      return this.កម្រោង.filter((ក) => ក.ឆ្នាំចប់ < (new Date()).getFullYear());
    },
    កម្រោងស្រាវជ្រាវបច្ចុប្បន្ន() {
      return this.កម្រោង.filter((ក) => ក.ឆ្នាំចប់ >= (new Date()).getFullYear());
    },
  },
};
</script>
